ChenLR/SIT/stm32/i2c-depth-sensor/Src/eink.c
#include "stm32f10x_gpio.h"
#include "delay.h"
#include "spi.h"
#include "eink.h"
#include "fonts.h"
#include <stdio.h>

// image buffer
static uint8_t image_buff[4736]; // 128 * 296 / 8
static int width = 128;
static int height = 296;

// private functions
void Eink_Reset(void);
void Eink_SendCommand(uint8_t command);
void Eink_SendData(uint8_t data);
void Eink_WaitUntilIdle(void);


void Eink_Reset() {
    GPIO_ResetBits(GPIOA, RST_PIN);
    DelayMs(200);
		GPIO_SetBits(GPIOA, RST_PIN);
    DelayMs(200);   
}


void Eink_SendCommand(uint8_t command) {
	GPIO_ResetBits(GPIOA, DC_PIN);
  //DigitalWrite(dc_pin, LOW);
  SPIx_Transfer(command);
}


void Eink_SendData(uint8_t data) {
    GPIO_SetBits(GPIOA, DC_PIN);
  //DigitalWrite(dc_pin, HIGH);
  SPIx_Transfer(data);
}


void Eink_WaitUntilIdle() {
    while(GPIO_ReadInputDataBit(GPIOA, BUSY_PIN) == 0) {      //0: busy, 1: idle
        DelayMs(100);
    }      
}

// from buffer to display

/**
 *  @brief: transmit partial data to the black part of SRAM
 */
void SetPartialWindowBlack(uint8_t * buffer_black, int x, int y, int w, int l) {
	  int i;
    Eink_SendCommand(PARTIAL_IN);
    Eink_SendCommand(PARTIAL_WINDOW);
    Eink_SendData(x & 0xf8);     // x should be the multiple of 8, the last 3 bit will always be ignored
    Eink_SendData(((x & 0xf8) + w  - 1) | 0x07);
    Eink_SendData(y >> 8);        
    Eink_SendData(y & 0xff);
    Eink_SendData((y + l - 1) >> 8);        
    Eink_SendData((y + l - 1) & 0xff);
    Eink_SendData(0x01);         // Gates scan both inside and outside of the partial window. (default) 
    DelayMs(2);
    Eink_SendCommand(DATA_START_TRANSMISSION_1);
    for(i = 0; i < w  / 8 * l; i++) {
        Eink_SendData(buffer_black[i]);  
    }
    DelayMs(2);
    Eink_SendCommand(PARTIAL_OUT);
}


/**
 *  @brief: transmit partial data to the black part of SRAM
 */
void SetPartialWindowRed(uint8_t * buffer_red, int x, int y, int w, int l) {
	  int i;
    Eink_SendCommand(PARTIAL_IN);
    Eink_SendCommand(PARTIAL_WINDOW);
    Eink_SendData(x & 0xf8);     // x should be the multiple of 8, the last 3 bit will always be ignored
    Eink_SendData(((x & 0xf8) + w  - 1) | 0x07);
    Eink_SendData(y >> 8);        
    Eink_SendData(y & 0xff);
    Eink_SendData((y + l - 1) >> 8);        
    Eink_SendData((y + l - 1) & 0xff);
    Eink_SendData(0x01);         // Gates scan both inside and outside of the partial window. (default) 
    DelayMs(2);
    Eink_SendCommand(DATA_START_TRANSMISSION_2);
    for(i = 0; i < w  / 8 * l; i++) {
        Eink_SendData(buffer_red[i]);  
    }
    DelayMs(2);
    Eink_SendCommand(PARTIAL_OUT);
}


/**
 * @brief: clear the frame data from the SRAM, this won't refresh the display
 */
void ClearFrame(void) {
	int i;
    Eink_SendCommand(TCON_RESOLUTION);
    Eink_SendData(width >> 8);
    Eink_SendData(width & 0xff);
    Eink_SendData(height >> 8);        
    Eink_SendData(height & 0xff);

    Eink_SendCommand(DATA_START_TRANSMISSION_1);           
    DelayMs(2);
    for(i = 0; i < width * height / 8; i++) {
        Eink_SendData(0xFF);  
    }  
    DelayMs(2);
    Eink_SendCommand(DATA_START_TRANSMISSION_2);           
    DelayMs(2);
    for(i = 0; i < width * height / 8; i++) {
        Eink_SendData(0xFF);  
    }  
    DelayMs(2);
}


void DisplayFrameOnly(void) {
	printf("Send Display Command\n");
	Eink_SendCommand(DISPLAY_REFRESH);
	printf("Wait for Idle\n");
	Eink_WaitUntilIdle();
	printf("Display finished\n");
}


// draw to buffer

/**
 *  @brief: clear buffer
 */
void ClearBuffer(void) {
	int i, j;
	for(j = 0; j < 296; j++) {
		for(i = 0; i < 16; i++) { // 128/8
			image_buff[j * 16 + i] = (IF_INVERT_COLOR)? 0x00 : 0xFF;
		}
	}
}


void DrawAbsolutePixel(int x, int y, int colored) {
	// 0xFF is white, 0x00 is black
	// draw as black as default
    if (x < 0 || x >= width || y < 0 || y >= height) {
        return;
    }
    if (IF_INVERT_COLOR) {
        if (colored) {
            image_buff[(x + y * width) / 8] |= 0x80 >> (x % 8);
        } else {
            image_buff[(x + y * width) / 8] &= ~(0x80 >> (x % 8));
        }
    } else {
        if (colored) {
            image_buff[(x + y * width) / 8] &= ~(0x80 >> (x % 8));  // call by default
        } else {
            image_buff[(x + y * width) / 8] |= 0x80 >> (x % 8);
        }
		}
}


void DrawPixel(int x, int y, int colored) {
    int point_temp;
	int rotate = ROTATE_90;
    if (rotate == ROTATE_0) {
        if(x < 0 || x >= width || y < 0 || y >= height) {
            return;
        }
        DrawAbsolutePixel(x, y, colored);
    } else if (rotate == ROTATE_90) {
        if(x < 0 || x >= height || y < 0 || y >= width) {
          return;
        }
        point_temp = x;
        x = width - y;
        y = point_temp;
        DrawAbsolutePixel(x, y, colored);
    } else if (rotate == ROTATE_180) {
        if(x < 0 || x >= width || y < 0 || y >= height) {
          return;
        }
        x = width - x;
        y = height - y;
        DrawAbsolutePixel(x, y, colored);
    } else if (rotate == ROTATE_270) {
        if(x < 0 || x >= height || y < 0 || y >= width) {
          return;
        }
        point_temp = x;
        x = y;
        y = height - point_temp;
        DrawAbsolutePixel(x, y, colored);
    }
}

/**
 *  @brief: this draws a charactor on the frame buffer but not refresh
 */
void DrawCharAt(int x, int y, char ascii_char, sFONT* font, int colored) {
    int i, j;
    unsigned int char_offset = (ascii_char - ' ') * font->Height * (font->Width / 8 + (font->Width % 8 ? 1 : 0));
    const uint8_t * ptr = &font->table[char_offset];

    for (j = 0; j < font->Height; j++) {
        for (i = 0; i < font->Width; i++) {
            if ( *ptr & (0x80 >> (i % 8))) {
                DrawPixel(x + i, y + j, colored);
            }
            if (i % 8 == 7) {
                ptr++;
            }
        }
        if (font->Width % 8 != 0) {
            ptr++;
        }
    }
}

/**
*  @brief: this displays a string on the frame buffer but not refresh
*/
void DrawStringAt(int x, int y, char* text, sFONT* font, int colored) {
    const char* p_text = text;
    unsigned int counter = 0;
    int refcolumn = x;
    
    /* Send the string character by character on EPD */
    while (*p_text != 0) {
        /* Display one character on EPD */
        DrawCharAt(refcolumn, y, *p_text, font, colored);
        /* Decrement the column position by 16 */
        refcolumn += font->Width;
        /* Point on the next character */
        p_text++;
        counter++;
    }
}


// public functions

void Eink_Init(void) {
	  SPIx_Init();
	/* EPD hardware init start */
    Eink_Reset();
    Eink_SendCommand(BOOSTER_SOFT_START);
    Eink_SendData(0x17);
    Eink_SendData(0x17);
    Eink_SendData(0x17);
    Eink_SendCommand(POWER_ON);
    Eink_WaitUntilIdle();
    Eink_SendCommand(PANEL_SETTING);
    Eink_SendData(0x8F);
    Eink_SendCommand(VCOM_AND_DATA_INTERVAL_SETTING);
    Eink_SendData(0x77);
    Eink_SendCommand(TCON_RESOLUTION);
    Eink_SendData(0x80);
    Eink_SendData(0x01);
    Eink_SendData(0x28);
    Eink_SendCommand(VCM_DC_SETTING_REGISTER);
    Eink_SendData(0X0A);
    /* EPD hardware init end */
}

void DisplayBlackFrame(uint8_t * frame_buffer_black) {
	int i;
    Eink_SendCommand(DATA_START_TRANSMISSION_1);
        DelayMs(2);
        for (i = 0; i < EPD_WIDTH * EPD_HEIGHT / 8; i++) {
            Eink_SendData(frame_buffer_black[i]);
        }
        DelayMs(2);

        Eink_SendCommand(DATA_START_TRANSMISSION_2);
        DelayMs(2);
        for (i = 0; i < EPD_WIDTH * EPD_HEIGHT / 8; i++) {
            Eink_SendData(0xFF);
        }
        DelayMs(2);
		printf("Transmission Complete\n");
    Eink_SendCommand(DISPLAY_REFRESH);
    Eink_WaitUntilIdle();
		printf("Display Complete\n");
}


void Eink_demo(void) {
	//uint8_t * dummy_buffer;
	ClearBuffer();
	//DrawCharAt(0, 0, 'a', &Font24, 1);
	DrawStringAt(0, 0, "10.40", &Font24, 1);
	ClearFrame();
	DisplayBlackFrame(image_buff);
	// DisplayFrameOnly();
}

